## Based on:
## https://www.taniarascia.com/setting-up-a-brand-new-mac-for-development/
## https://danielmiessler.com/blog/first-10-things-new-mac/
## https://hackercodex.com/guide/python-development-environment-on-mac-osx/
## See homebrew-bundle:
## https://github.com/Homebrew/homebrew-bundle
## forked from gihub: pndurette/mac-setup

## Command-Line Mac App Store
brew 'mas'
# NB: Sign into the App Store GUI first, then 'brew install mas'
# mas signin is broken on macOS 10.13+ — manual sign-in required
# mas 'Microsoft Defender', id: 1526737990

## Cask macOS apps
# cask 'adobe-creative-cloud'
cask 'arc'
# cask 'blackhole-2ch'
cask 'bitwarden'
cask 'cryptomator'
# cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'fluidvoice'
cask 'google-chrome'
# cask 'inkscape'
cask 'microsoft-edge'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'notion'
cask 'onedrive'
# cask 'obs'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'synologyassistant'
cask 'the-unarchiver'
cask 'via'
cask 'vlc'
cask 'zoom'

## Tap dev stuff
tap 'azure/kubelogin'
tap 'microsoft/mssql-release'

## Cask dev apps
cask '1password'
cask 'azure-data-studio'
cask 'db-browser-for-sqlite'
cask 'claude'
cask 'claude-code'
cask 'iterm2'
cask 'microsoft-teams'
cask 'postman'
cask 'remote-desktop-manager'
cask 'sourcetree'
cask 'sublime-text'
cask 'typora'
cask 'utm'
cask 'vmware-fusion'

## Fonts
cask 'font-hack-nerd-font'
cask 'font-anton'
cask 'font-cormorant'
cask 'font-epilogue'
cask 'font-ibm-plex-mono'
cask 'font-lora'
cask 'font-manrope'
cask 'font-montserrat'
cask 'font-nunito-sans'
cask 'font-oswald'
cask 'font-oxygen'
cask 'font-playfair-display'
cask 'font-proza-libre'
cask 'font-raleway'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-rubik'
cask 'font-sora'

## Make macOS more linux-y
brew 'binutils'
brew 'coreutils'
brew 'diffutils'
brew 'findutils'
brew 'ffmpeg'
brew 'gpg'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'htop'
brew 'less'
brew 'nmap'
brew 'speedtest-cli'
brew 'telnet'
brew 'tmux'
brew 'watch'
brew 'wireshark'
brew 'wget'
brew 'yt-dlp'

## Dev
brew 'antidote'
brew 'automake'
brew 'bash'
brew 'bat'
brew 'eza'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'jq'
brew 'make'
brew 'mise'
brew 'nano'
brew 'openssl'
brew 'peco'
brew 'rpm'
brew 'tcpdump'
brew 'whois'
brew 'vim'
brew 'zlib'
brew 'zsh'

## Dev/Cloud
brew 'awscli'
brew 'azure-cli'
cask 'google-cloud-sdk'
brew 'k9s'

## Dev/Containers
brew 'kubernetes-cli' # i.e. kubectl
brew 'helm'
cask 'docker'

## Java 8 (JRE) <-- skip for now until needed
# cask 'homebrew/cask-versions/java8'

## FUSE-T (for Cryptomator)
tap 'macos-fuse-t/homebrew-cask'
cask 'fuse-t'
cask 'fuse-t-sshfs'
