# zsh plugins to load via Antidote
# more plugins here: https://github.com/ohmyzsh/ohmyzsh/wiki/Plugins

# Theme: PowerLevel10k
romkatv/powerlevel10k

# Autocompletion
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
# zsh-users/zsh-history-substring-search <-- Didn't like it
olets/zsh-abbr

# Dev 
zdharma-continuum/fast-syntax-highlighting
jimeh/zsh-peco-history
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/azure
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/pip

# Currently Broken
# ohmyzsh/ohmyzsh path:plugins/autopep8
# ohmyzsh/ohmyzsh path:plugins/docker
